<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"a060c5a2a149fe6a0c0c5938abaec1ef60fb5d0cdfa58757421b214087470eef","plan_job_ref":"Job Staging Image Build & Push #16 at https://github.com/IrezD/python-fastAPI-docker-image-v2/actions/runs/7348185168","plan_hash":"5e1ebba4926f299392d30e902c9ae67032b44db510928fa146759e90681dff6d","plan_text_format":"diff","version":"1.39.0","closed":true} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_lb_listener.listerner_443 will be created
+   resource "aws_lb_listener" "listerner_443" {
+       arn               = (known after apply)
+       certificate_arn   = "arn:aws:acm:eu-central-1:806066816337:certificate/ce157388-cd24-4841-9044-fbd2ab762400"
+       id                = (known after apply)
+       load_balancer_arn = "arn:aws:elasticloadbalancing:eu-central-1:806066816337:loadbalancer/app/fastapi-lb-dev/78fa42d138c4f3f0"
+       port              = 443
+       protocol          = "HTTPS"
+       ssl_policy        = "ELBSecurityPolicy-2016-08"
+       tags_all          = {
+           "Environment" = "Dev Environment"
        }

+       default_action {
+           order            = (known after apply)
+           target_group_arn = "arn:aws:elasticloadbalancing:eu-central-1:806066816337:targetgroup/alb-target-group-dev-443/4c3e823ca057454b"
+           type             = "forward"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Staging Image Build & Push #16](https://github.com/IrezD/python-fastAPI-docker-image-v2/actions/runs/7348185168)
<details open><summary>Outputs</summary>

```hcl
ecr_registry_id     = "806066816337"
ecr_repository_name = "dev/irezd/fastapi"
```
</details>